Revit 2027 API
CurveLoop.IsOpen Method
 Returns whether the curve loop is open or closed, as determined by an internal flag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOpen()
Public Function IsOpen As Boolean
public:
bool IsOpen()
member IsOpen : unit -> bool
Return Value
Boolean
 True if the CurveLoop is marked open, false if marked closed.
Remarks
 Some routines in Revit may set the CurveLoop to be marked "open" or "closed" in spite of the actual geometry of the curves. In these special cases, the CurveLoop class does not require that the CurveLoop is correctly marked.
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace